# Importing Libraries and Creating Engine

In [1]:
from pypandoc.pandoc_download import download_pandoc

In [1]:
import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

engine = create_engine("mysql+mysqlconnector://username:passwd@host/database")

engine.connect()

print(engine)

print("***engine_running***")

SyntaxError: invalid syntax (<ipython-input-1-5eb444c6e708>, line 6)

# Loading SQL Extension

In [2]:
%load_ext sql

%sql mysql+mysqlconnector://username:passwd@host/database

# Showing Tables in the Database

In [3]:
%%sql

SHOW TABLES;

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
3 rows affected.

[('chicago_census_data',), ('chicago_crime',), ('chicago_public_schools',)]

# Capstone Queries

## Problem 1: Find the total number of crimes recorded in the crime table.

In [7]:
%%sql

select count(ID) from chicago_crime

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
1 rows affected.

[(503,)]

## Problem 2: Retrieve first 10 rows from the CRIME table.

In [8]:
%%sql

select * from chicago_crime limit 10

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
10 rows affected.

[('10003235', 'HY192694', datetime.date(2015, 3, 21), '064XX S OAKLEY AVE', 486, 'BATTERY', 'DOMESTIC BATTERY SIMPLE', 'APARTMENT', 'FALSE', 'FALSE', '825', '8', '15', '66', '08B', '1162182', '1861826', '2015', datetime.date(2018, 2, 10), 41.77651055, -87.68100012, '(41.776510546, -87.681000121)'),
 ('10012707', 'HY202462', datetime.date(2015, 3, 28), '056XX W BYRON ST', 810, 'THEFT', 'OVER $500', 'STREET', 'FALSE', 'FALSE', '1633', '16', '38', '15', '6', '1138080', '1925360', '2015', datetime.date(2018, 2, 10), 41.95132446, -87.76782401, '(41.95132446, -87.767824012)'),
 ('10015483', 'HY204891', datetime.date(2015, 3, 31), '011XX N PULASKI RD', 4625, 'OTHER OFFENSE', 'PAROLE VIOLATION', 'SIDEWALK', 'TRUE', 'FALSE', '1112', '11', '27', '23', '26', '1149510', '1907365', '2015', datetime.date(2018, 2, 10), 41.90172993, -87.7262756, '(41.901729932, -87.726275604)'),
 ('10025545', 'HY215032', datetime.date(2015, 4, 8), '039XX W LEXINGTON ST', 2014, 'NARCOTICS', 'MANU/DELIVER: HEROIN (WHITE)', 'SIDEWALK', 'TRUE', 'FALSE', '1132', '11', '24', '26', '18', '1150205', '1896407', '2015', datetime.date(2018, 2, 10), 41.87164648, -87.72400857, '(41.871646482, -87.724008569)'),
 ('10046030', 'HY234744', datetime.date(2015, 4, 24), '008XX N MICHIGAN AVE', 860, 'THEFT', 'RETAIL THEFT', 'DEPARTMENT STORE', 'TRUE', 'FALSE', '1833', '18', '42', '8', '6', '1177338', '1906213', '2015', datetime.date(2018, 2, 10), 41.89798294, -87.62409563, '(41.897982937, -87.624095634)'),
 ('10070513', 'HY259084', datetime.date(2015, 5, 13), '056XX S WOOD ST', 3710, 'INTERFERENCE WITH PUBLIC OFFICER', 'RESIST/OBSTRUCT/DISARM OFFICER', 'STREET', 'FALSE', 'FALSE', '715', '7', '15', '67', '24', '1165309', '1867385', '2015', datetime.date(2018, 2, 10), 41.79169949, -87.6693793, '(41.791699487, -87.669379304)'),
 ('10079280', 'HY267896', datetime.date(2015, 5, 20), '115XX S STEWART AVE', 1320, 'CRIMINAL DAMAGE', 'TO VEHICLE', 'RESIDENTIAL YARD (FRONT/BACK)', 'FALSE', 'TRUE', '522', '5', '34', '53', '14', '1175695', '1828405', '2015', datetime.date(2015, 8, 17), 41.68450696, -87.63245993, '(41.684506962, -87.632459932)'),
 ('10084732', 'HY273740', datetime.date(2015, 5, 24), '004XX N STATE ST', 820, 'THEFT', '$500 AND UNDER', 'BAR OR TAVERN', 'FALSE', 'FALSE', '1831', '18', '42', '8', '6', '1176302', '1903096', '2015', datetime.date(2018, 2, 10), 41.88945317, -87.62799483, '(41.889453169, -87.627994833)'),
 ('10102551', 'HY291329', datetime.date(2015, 6, 6), '028XX W DEVON AVE', 860, 'THEFT', 'RETAIL THEFT', 'DRUG STORE', 'FALSE', 'FALSE', '2413', '24', '50', '2', '6', '1156278', '1942331', '2015', datetime.date(2018, 2, 10), 41.9975448, -87.70046744, '(41.997544797, -87.700467444)'),
 ('10177662', 'HY365876', datetime.date(2015, 8, 2), '041XX W 87TH ST', 1811, 'NARCOTICS', 'POSS: CANNABIS 30GMS OR LESS', 'STREET', 'TRUE', 'FALSE', '834', '8', '18', '70', '18', '1150504', '1846544', '2015', datetime.date(2018, 2, 10), 41.73480925, -87.72420818, '(41.734809253, -87.724208178)')]

## Problem 3: How many crimes involve an arrest.

In [10]:
%%sql

select count(ID) as involve_arrest from chicago_crime where ARRST = 'True'

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
1 rows affected.

[(153,)]

## Problem 4: Which unique types of crimes (e.g. THEFT) have been recorded at a GAS STATION locations?

In [16]:
%%sql


select DISTINCT(PRIMARY_TYPE) AS PR_TYP_GAS_STN from chicago_crime where LOCATION_DESCRIPTION = 'GAS STATION'

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
4 rows affected.

[('THEFT',), ('CRIMINAL TRESPASS',), ('NARCOTICS',), ('ROBBERY',)]

## Problem 5: In the CENUS_DATA table list all community areas whose names start with the letter ‘B’.

In [23]:
%%sql

#SELECT * FROM chicago_census_data limit 2

select COMMUNITY_AREA_NAME from chicago_census_data where COMMUNITY_AREA_NAME like 'B%'

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
5 rows affected.

[('Belmont Cragin',),
 ('Burnside',),
 ('Brighton Park',),
 ('Bridgeport',),
 ('Beverly',)]

## Problem 6: List the schools in community areas 10 to 15 that are healthy school certified.

In [78]:
%%sql

#List the schools in community areas 10 to 15 that are healthy school certified.


#select * from chicago_public_schools limit 2

select school_id, name_of_school from chicago_public_schools
    where community_area_number >=10 and community_area_number <=15 and healthy_school_certified = 'YES'

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
1 rows affected.

[(609995, 'Rufus M Hitch Elementary School')]

## Problem 7: What is the average school Safety Score?

In [35]:
%%sql

#select * from chicago_public_schools limit 2

select Avg(safety_score) from chicago_public_schools

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
1 rows affected.

[(49.50487329434698,)]

## Problem 8: Find the top 5 Community Areas by average College Enrollment.

In [66]:
%%sql

#Find the top 5 Community Areas by average College Enrollment [number of students].

select community_area_name from chicago_public_schools
    order by (select avg(college_enrollment) from chicago_public_schools) DESC limit 5;

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
5 rows affected.

[('LINCOLN PARK',),
 ('SOUTH SHORE',),
 ('ASHBURN',),
 ('NEW CITY',),
 ('ARMOUR SQUARE',)]

## Problem 9: Use a sub-query to determine which Community Area has the least value for school Safety Score.

In [68]:
%%sql

#Use a sub-query to determine which Community Area has the least value for school Safety Score?

select community_area_number, community_area_name from chicago_public_schools
    where safety_score = (select min(safety_score) from chicago_public_schools)

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
1 rows affected.

[('40', 'WASHINGTON PARK')]

## Problem 10: Without using an explicit JOIN operator, find the Per Capita Income of the Community Area which has a school Safety Score of 1.

In [71]:
%%sql

select cps.SAFETY_SCORE, cps.COMMUNITY_AREA_NUMBER, cps.COMMUNITY_AREA_NAME, ccd.PER_CAPITA_INCOMe
from chicago_public_schools cps, chicago_census_data ccd
    where cps.COMMUNITY_AREA_NUMBER = ccd.COMMUNITY_AREA_NUMBER
    and cps.SAFETY_SCORE = 1

 * mysql+mysqlconnector://root:***@127.0.0.1/capstone
1 rows affected.

[('1', '40', 'WASHINGTON PARK', 13785)]

# PROJECT COMPLETED!